*** Shallow Copy
   #+begin_src python :results output
   a = [1, 2, 3]
   b = a
   b[1] =8
   print a
   #+end_src

   #+RESULTS:
   : [1, 8, 3]
   : hello



